In [2]:
%pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp310-cp310-macosx_10_9_x86_64.whl.metadata (89 kB)
Collecting numpy>=1.22.4 (from pandas)
  Downloading numpy-2.1.2-cp310-cp310-macosx_10_9_x86_64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/jaquelinedicroce/Library/Python/3.10/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/jaquelinedicroce/Library/Python/3.10/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp310-cp310-macosx_10_9_x86_64.whl (12.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.6/12.6 MB 13.3 MB/s eta 0:00:00a 0:00:01
Downloading numpy-2.1.2-cp310-cp310-macosx_10_9_x86_64.whl (21.2 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 21.2/21.2 MB 22.6 MB/s eta 0:00:00a 0:00:01
Using cached pytz-2024.2-py2.py3-none-any.whl (508 kB)
Using cached tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.1.2 pandas-2.2.3 pytz-2024.2 tzdata-2024.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np

### PREPROCESAMIENTO

In [4]:
df = pd.read_csv('data/ds_salaries.csv')

df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [5]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [6]:
df.shape

(3755, 11)

In [7]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [8]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [9]:
df.duplicated().sum()

np.int64(1171)

In [19]:
duplicados = df.value_counts()
duplicados

work_year  experience_level  employment_type  job_title           salary  salary_currency  salary_in_usd  employee_residence  remote_ratio  company_location  company_size
2022       SE                FT               Data Scientist      191475  USD              191475         US                  100           US                M               21
                                                                  141525  USD              141525         US                  100           US                M               21
2023       SE                FT               Data Engineer       129000  USD              129000         US                  0             US                M               13
                                                                  252000  USD              252000         US                  0             US                M               13
2022       SE                FT               Data Engineer       130000  USD              130000         US                  0             US                M               12
                                                                                                                                                                              ..
2020       EN                FT               Research Scientist  42000   USD              42000          NL                  50            NL                L                1
                             PT               Data Scientist      19000   EUR              21669          IT                  50            IT                S                1
                                              ML Engineer         14000   EUR              15966          DE                  100           DE                S                1
           EX                FT               Data Engineer       70000   EUR              79833          ES                  50            ES                L                1
           EN                FT               Data Analyst        72000   USD              72000          US                  100           US                L                1
Name: count, Length: 2584, dtype: int64

In [20]:
def mas_repetidos(df):
    df_duplicados = df[df.duplicated(keep=False)]
    df_agrupado = df_duplicados.groupby(df.columns.tolist()).size().reset_index().rename(columns={0: 'count'})
    df_ordenado = df_agrupado.sort_values(by='count', ascending=False)
    return df_ordenado

mas_repetidos(df)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,count
223,2022,SE,FT,Data Scientist,191475,USD,191475,US,100,US,M,21
201,2022,SE,FT,Data Scientist,141525,USD,141525,US,100,US,M,21
399,2023,SE,FT,Data Engineer,129000,USD,129000,US,0,US,M,13
441,2023,SE,FT,Data Engineer,252000,USD,252000,US,0,US,M,13
221,2022,SE,FT,Data Scientist,185900,USD,185900,US,0,US,M,12
...,...,...,...,...,...,...,...,...,...,...,...,...
510,2023,SE,FT,Data Scientist,239748,USD,239748,US,0,US,M,2
508,2023,SE,FT,Data Scientist,228000,USD,228000,US,0,US,M,2
507,2023,SE,FT,Data Scientist,225000,USD,225000,US,100,US,M,2
504,2023,SE,FT,Data Scientist,201000,USD,201000,US,0,US,M,2
503,2023,SE,FT,Data Scientist,200160,USD,200160,US,0,US,M,2

In [21]:
df.drop_duplicates(inplace=True)

In [22]:
df.shape

(2584, 11)

### EDA (Exploratory Data Analyst)

In [23]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

0. ¿De que pais son la mayoria de compañias?

In [35]:
df0 = df.groupby('company_location').count()['salary'].sort_values(ascending=False).head(5)

df0

company_location
US    1929
GB     155
CA      83
IN      57
DE      55
Name: salary, dtype: int64

1. ¿En que puesto se gana mas?

In [26]:
df1 = df.groupby('job_title')['salary'].sum().sort_values(ascending=False)
df1

job_title
Data Scientist               154112098
Data Engineer                 97215593
Data Analyst                  46421881
Machine Learning Engineer     38354342
ML Engineer                   20739929
                               ...
Data DevOps Engineer             50000
Finance Data Analyst             45000
Compliance Data Analyst          30000
Staff Data Analyst               15000
Product Data Scientist            8000
Name: salary, Length: 93, dtype: int64

In [ ]:
#opcion B 
df2 = df.groupby('job_title').sum()['salary'].sort_values(ascending=False)

df2

2. Tipo de trabajo, pais de residencia donde mas se cobra?

In [43]:
df2 = df.groupby(['employment_type','employee_residence']).sum()['salary'].sort_values(ascending=False)

df2

employment_type  employee_residence
FT               US                    290398567
                 IN                    115758997
                 CL                     30505000
                 HU                     28600000
                 JP                     20492000
                                         ...
PT               BR                        12000
                 PK                        12000
FT               MA                        10000
CT               BO                         7500
FT               MK                         6000
Name: salary, Length: 101, dtype: int64

3. ¿El nivel de  experiencia es proporcional al salario?

In [49]:
df3 = df.groupby('experience_level').sum()['salary'].sort_values(ascending=False)
df3

experience_level
SE    281992959
MI    183549077
EN     53785057
EX     24256833
Name: salary, dtype: int64

4. ¿Cuanto se cobra de media por cada nivel de experiencia?

In [58]:
df4 = df.groupby('experience_level')['salary'].mean().sort_values(ascending=False)
df4

experience_level
MI    276429.332831
EX    252675.343750
EN    199203.914815
SE    181462.650579
Name: salary, dtype: float64

5. ¿En qué tamaño de compañía trabajan más?

In [44]:
df5 = df.groupby('company_size').count()['salary'].sort_values(ascending=False)
df5

company_size
M    2028
L     409
S     147
Name: salary, dtype: int64

6. ¿Por que porcentage promedio se aumenta el salario entre nivel de experiencia?

In [69]:
#promedio por nivel de experiencia
df6 = df.groupby('experience_level')['salary'].mean().reset_index()
df6 = df6.sort_values(by='experience_level')

#incremento
df6['percentage_increase'] = df6['salary'].pct_change() * 100

df6

  experience_level         salary  percentage_increase
0               EN  199203.914815                  NaN
1               EX  252675.343750            26.842559
2               MI  276429.332831             9.400992
3               SE  181462.650579           -34.354778

7. ¿En que pais se cobra  mas por tipo de empleo?

In [80]:
df7 = df.groupby(['company_location','employment_type'])['salary_in_usd'].mean().round(2).sort_values(ascending=False)
df7

company_location  employment_type
IL                FT                 271446.50
PR                FT                 167500.00
US                FT                 153000.28
RU                FT                 140333.33
US                CT                 137062.50
                                       ...
ES                PT                  10354.00
MA                FT                  10000.00
AL                FT                  10000.00
BO                CT                   7500.00
MK                FT                   6304.00
Name: salary_in_usd, Length: 87, dtype: float64

In [81]:
df7_0 = df.groupby(['company_location','employment_type']).agg({'salary_in_usd':'mean'}).round(2)
df7_0 = df7_0.sort_values(by='salary_in_usd', ascending=False)
df7_0

                                  salary_in_usd
company_location employment_type
IL               FT                   271446.50
PR               FT                   167500.00
US               FT                   153000.28
RU               FT                   140333.33
US               CT                   137062.50
...                                         ...
ES               PT                    10354.00
MA               FT                    10000.00
AL               FT                    10000.00
BO               CT                     7500.00
MK               FT                     6304.00

[87 rows x 1 columns]

8. Which are experience level more required?

In [70]:
df8 = df.groupby('experience_level')['salary'].count().sort_values(ascending=False)
df8

experience_level
SE    1554
MI     664
EN     270
EX      96
Name: salary, dtype: int64